data = [
    (1, 'Иван', 'Медведев', '2005-08-04', 'мужской', '2023-03-22', 'Программист', 'IT', '100000'),
    (2, 'Михаил', 'Петров', '1990-03-06', 'мужской', '2020-06-19', 'Менеджер', 'Отдел продаж', '73000'),
    (3, 'Оксана', 'Селезнева', '1973-12-02', 'женский', '2019-04-12', 'Менеджер', 'Отдел кадров', '68000'),
    (4, 'Иван', 'Свешников', '1999-05-03', 'мужской', '2022-09-02', 'Программист', 'IT', '110000'),
    (5, 'Юрий', 'Кобелев', '1976-04-16', 'мужской', '2018-05-13', 'Директор', 'Агротехнический комлпекс', '150000'),
    (6, 'Евгений', 'Касьянов', '2002-07-13', 'мужской', '2023-03-17', 'Главный Бухгалтер', 'Агротехнический комлпекс', '90000'),
    (7, 'Макс', 'Зубков', '1999-01-13', 'мужской', '2023-09-12', 'Бухгалтер', 'Агротехнический комлпекс', '70000'),
    (8, 'Василиса', 'Романова', '1997-07-18', 'женский', '2018-05-18', 'Секретарша', 'Отдел кадров', '83000'),
    (9, 'Елизавета', 'Романова', '1996-04-23', 'женский', '2019-04-30', 'Бухгалтер', 'Отдел кадров', '86000'),
    (10, 'Виктория', 'Попова', '2000-11-22', 'женский', '2021-06-27', 'Программист', 'IT', '89000'),
]

lists = [
    ('100', '1', '2023-03-12', '2023-03-19', 'болезнь', 'простуда', 'YES'),
    ('101', '1', '2023-07-14', '2023-07-16', 'болезнь', 'ОРВИ', 'NO'),
    ('102', '2', '2020-09-10', '2020-09-30', 'болезнь', 'простуда', 'YES'),
    ('103', '5', '2023-07-18', '2023-07-27', 'болезнь', 'COVID', 'YES'),
    ('104', '3', '2021-05-13', '2021-05-21', 'болезнь', 'ангина', 'YES'),
    ('105', '4', '2017-03-10', '2017-03-23', 'болезнь', 'простуда', 'NO'),
    ('106', '6', '2017-01-04', '2021-04-07', 'болезнь', 'тонзиллит', 'YES'),
    ('107', '7', '2023-08-03', '2023-08-11', 'болезнь', 'простуда', 'YES'),
    ('108', '8', '2019-12-05', '2019-12-10', 'болезнь', 'бронхит', 'YES'),
    ('109', '8', '2020-01-01', '2020-01-09', 'болезнь', 'простуда', 'NO'),
    ('110', '9', '2021-04-12', '2021-12-02', 'болезнь', 'туберкулез', 'YES'),
]

